_protected/controllers/AjaxController.php

	public function actionFetch() {

		if (Yii::$app->request->isAjax) {
			Yii::$app->response->format = Response::FORMAT_JSON;

			$now = time();
			$from = $now - (2 * 24 * 60 * 60);
			$object = Board::find()->where(['between' ,'created_at' , $from, $now])->orderBy(['id' => SORT_ASC])->all();
			$data = array();

			//CURRENT USER
			$id = array('uid' => Yii::$app->user->identity->id);
			$img = array('uimg' => Yii::$app->user->identity->profile_image);
			$sg = array('ug' => Yii::$app->user->identity->gender);
			$base = array('url' => Yii::$app->request->hostInfo);

			for($i = 0; $i < count($object); $i++){
				$object[$i]['content'] = Html::encode($object[$i]['content']);
				$username = User::findOne(['id' => $object[$i]['posted_by']])->username;
---
SELECT * FROM `board` WHERE `created_at` BETWEEN 1457966829 AND 1458571629 ORDER BY `id`
SELECT * FROM `user` WHERE `id`=1