_protected/controllers/DashboardController.php

    protected function findBoard($id)
    {
        if (($board = Board::findOne($id)) !== null) {
---
SELECT * FROM `board` WHERE `created_at` BETWEEN 1452152449 AND 1457180068 ORDER BY `id`