_protected/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `account_activation_token`, `created_at`, `updated_at`) VALUES ('zup', 'zup@zup.com', '$2y$13$TGlQBhPSBQJfAsUCFh5OZeRU3zOlUCKCzg2v8XDcraGRdNyghG3QO', 'FMkK4wxuZ9NaeHudZwnXyQgNBSVa0nPp', 1, 'JzNuwXXhv5e_OgTvOves3aNq-f7c2YVo_1460370230', 1460370230, 1460370230)
---
    public function signup()
    {
        $user = new User();

        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->status = $this->status;
        // if scenario is "rna" we will generate account activation token
        if ($this->scenario === 'rna')
        {
            $user->generateAccountActivationToken();
        }

        // if user is saved and role is assigned return user object
        return $user->save() && RbacHelper::assignRole($user->getId()) ? $user : null;