_protected/models/User.php

    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email]);
---
SELECT * FROM `user` WHERE `email`='teacher@teacher.com'