_protected/rbac/models/AuthAssignment.php

    public static function getAssignment($user_id)
    {
        $item_name = static::find()->select('item_name')->where(['user_id' => $user_id])->one();
---
SELECT `item_name` FROM `auth_assignment` WHERE `user_id`=9