_protected/rbac/models/AuthItem.php

    public static function getRoles()
    {

        if (!Yii::$app->user->isGuest){
            $role = AuthAssignment::getAssignment(Yii::$app->user->identity->id);
        }

        if ($role === 'dev' || $role === 'master')
        {
            return static::find()->select('name')->where(['type' => 1])->all();
---
SELECT `name` FROM `auth_item` WHERE `type`=1