_protected/rbac/helpers/RbacHelper.php

    public static function assignRole($id)
    {
        Role::deleteAll(['user_id' => $id]);

        $usersCount = User::find()->count();
---
SELECT COUNT(*) FROM `user`